export let units = {
    1: 'одна',
    2: 'дві',
    3: 'три',
    4: 'чотири',
    5: 'пʼять',
    6: 'шість',
    7: 'сім',
    8: 'вісім',
    9: 'девʼять',
}

export let dozens = {
    1: 'x',
    2: 'двадцять',
    3: 'тридцять',
    4: 'сорок',
    5: 'пʼятдусят',
    6: 'шістдесят',
    7: 'сімдесят',
    8: 'вісімдесят',
    9: 'девʼяносто',
}

export let hundreds = {
    1: 'сто',
    2: 'двісті',
    3: 'триста',
    4: 'чотириста',
    5: 'пʼятсот',
    6: 'шістсот',
    7: 'сімсот',
    8: 'вісімсот',
    9: 'девʼятсот',
}

export let thousands = {
    1: units[1] + ' тисяча',
    2: units[2] + ' тисячі',
    3: units[3] + ' тисячі',
    4: units[4] + ' тисячі',
    5: units[5] + ' тисяч',
    6: units[6] + ' тисяч',
    7: units[7] + ' тисяч',
    8: units[8] + ' тисяч',
    9: units[9] + ' тисяч',
}

export let tenThousands = {
    1: 'x',
    2: 'двадцять',
    3: 'тридцять',
    4: 'сорок',
    5: 'пʼятдeсят',
    6: 'шістдесят',
    7: 'сімдесят',
    8: 'вісімдесят',
    9: 'девʼяносто',
}

export let hundredsThousands = {
    1: 'сто',
    2: 'двісті',
    3: 'триста',
    4: 'чотириста',
    5: 'пʼятсот',
    6: 'шістсот',
    7: 'сімсот',
    8: 'вісімсот',
    9: 'девʼятсот',
}

export let millions = {
    1: 'один мільйон',
    2: units[2] + ' мільйони',
    3: units[3] + ' мільйони',
    4: units[4] + ' мільйони',
    5: units[5] + ' мільйонів',
    6: units[6] + ' мільйонів',
    7: units[7] + ' мільйонів',
    8: units[8] + ' мільйонів',
    9: units[9] + ' мільйонів',
}